luxe/app/controllers/guests_controller.rb

INSERT INTO "guests" ("first_name", "last_name", "phone", "room_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Jared"], ["last_name", "Sobol"], ["phone", "8088325"], ["room_number", 100], ["created_at", "2015-09-19 23:27:39.507218"], ["updated_at", "2015-09-19 23:27:39.507218"]]
SELECT  "hotels".* FROM "hotels" LIMIT 1
---
  def create
    @guest = Guest.new(guest_params)
    if @guest.save
      @guest.key = @guest.last_name + @guest.phone[-4..-1]
      @guest.hotel_id = session[:hotel_id]
      @guest.save
      @client
      @users_hotel_id = @guest.hotel_id
      @hotel = Hotel.find_by(params[:hotel_id])
      "@@" * 88
      phone_twilio = @guest.phone
      name_twilio = @guest.first_name

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @guest = Guest.find(params[:id])
    @services = Service.where(hotel_id: @guest.hotel_id)
    @hotel = Hotel.find_by(id: @guest.hotel_id)