luxe/app/controllers/hotels_controller.rb

  def create
    @hotel = Hotel.new(hotel_params)
    if @hotel.save
---
INSERT INTO "hotels" ("name", "email", "password_digest", "amenities", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @hotel = Hotel.find_by(id: session[:hotel_id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT 1  [["id", 1]]