luxe/app/controllers/services_controller.rb

  def create
    @service = Service.new(service_params)
    if @service.save
      @guest = Guest.find(session[:guest_id])
---
INSERT INTO "services" ("title", "hotel_id", "guest_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "SERVICE111"], ["hotel_id", 1], ["guest_id", 1], ["created_at", "2015-09-21 21:58:16.719366"], ["updated_at", "2015-09-21 21:58:16.719366"]]
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", nil]]