luxe/app/controllers/sessions_controller.rb

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."email" = $1 LIMIT 1  [["email", "w@hotel.com"]]
SELECT  "guests".* FROM "guests" WHERE "guests"."key" = $1 LIMIT 1  [["key", "Sobol8325"]]
---
  def create
     if params[:email] != nil
      hotel = Hotel.find_by_email(params[:email])
      if hotel && hotel.authenticate(params[:password])
        session[:hotel_id] = hotel.id
        redirect_to '/hotels/show', :notice => "Logged in!"
      else
          flash.now.alert = "Invalid email or password"
          redirect_to '/login'
      end
    elsif params[:key] != nil
      guest = Guest.find_by_key(params[:key])